# -*- org-confirm-babel-evaluate: nil; -*-
#+TITLE: Juice Notebook
#+AUTHOR: Marie Delavergne, Ronan-Alexandre Cherrueau
#+EMAIL: {firstname.lastname}@inria.fr
#+DATE: <2018>

#+LANGUAGE: en
#+OPTIONS: email:t
#+OPTIONS: ^:{}
#+OPTIONS: broken-links:mark

#+PROPERTY: header-args:python  :session default
#+PROPERTY: header-args:python+ :cache no
#+PROPERTY: header-args:python+ :var SNS_CONTEXT="notebook"
# #+PROPERTY: header-args:python+ :exports both  # export contains code + result see [[info:org#Exporting%20code%20blocks][info:org#Exporting code blocks]]
# #+PROPERTY: header-args:python+ :results output

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="timeline.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://cdn.datatables.net/1.10.16/css/jquery.dataTables.css">
#+HTML_HEAD: <script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha256-3edrmyuQ0w65f8gfBsqowzjJe2iM6n0nKciPUp8y+7E=" crossorigin="anonymous"></script>
#+HTML_HEAD: <script type="text/javascript" charset="utf8" src="https://cdn.datatables.net/1.10.16/js/jquery.dataTables.js"></script>

#+BEGIN_abstract
OpenStack is the /de facto/ open source solution for the management of
cloud infrastructures and emerging solution for edge infrastructures
(/i.e./, hundreds of geo-distributed micro DCs composed of dozens of
servers). Unfortunately, some modules used by OpenStack services do
not fulfill edge infrastructure needs. For instance, core services use
the MariaDB Relational Database Management System (RDBMS) to store
their state. And a single MariaDB may not cope with thousands of
connections and intermittent network access. Therefore, is OpenStack
technically ready for the management of an edge infrastructure? To
find this out, we built /Juice/. Juice tests and evaluates the
performance of Relational Database Management Systems (RDBMS) in the
context of a distributed OpenStack with high latency network. The
*** Raw Results                                                    :noexport:
#+BEGIN_SRC python :results raw :exports results
# XPS_CSIZE_NBURST.map(scn_mean_std).map(df2orgtablestr).make_string('\n')
#+END_SRC

#+RESULTS:
('KeystoneBasic.create_and_list_tenants', 'galera', 3)
('KeystoneBasic.create_and_list_tenants', 'galera', 3)
#+CAPTION: KeystoneBasic.authenticate_user_and_validate_token
#+NAME: tbl:KeystoneBasic.authenticate_user_and_validate_token
| Authenticate User... | keystone_v3.fetch_token | keystone_v3.validate_token |   std |
|----------------------+-------------------------+----------------------------+-------|
| ('cockroachdb', 3)   |                   0.054 |                      0.083 | 0.003 |
| ('cockroachdb', 9)   |                   0.058 |                      0.090 | 0.005 |
| ('cockroachdb', 45)  |                   0.059 |                      0.093 | 0.003 |
| ('galera', 3)        |                   0.046 |                      0.068 | 0.005 |
| ('galera', 9)        |                   0.045 |                      0.070 | 0.004 |
| ('galera', 45)       |                   0.049 |                      0.077 | 0.010 |
| ('mariadb', 3)       |                   0.042 |                      0.067 | 0.003 |
| ('mariadb', 9)       |                   0.045 |                      0.067 | 0.003 |
| ('mariadb', 45)      |                   0.048 |                      0.077 | 0.006 |

#+CAPTION: KeystoneBasic.create_add_and_list_user_roles
#+NAME: tbl:KeystoneBasic.create_add_and_list_user_roles
|Create Add And...|keystone_v3.create_role|keystone_v3.add_role|keystone_v3.list_roles|std|
|--
|('cockroachdb', 3)|0.104|0.032|0.032|0.024|
|('cockroachdb', 9)|0.106|0.032|0.032|0.023|
|('cockroachdb', 45)|0.121|0.035|0.035|0.028|
|('galera', 3)|0.071|0.026|0.026|0.005|
|('galera', 9)|0.074|0.028|0.027|0.004|
|('galera', 45)|0.133|0.076|0.048|0.090|
|('mariadb', 3)|0.077|0.025|0.026|0.015|
|('mariadb', 9)|0.080|0.025|0.026|0.017|
|('mariadb', 45)|0.077|0.027|0.028|0.011|

#+CAPTION: KeystoneBasic.create_and_list_tenants
#+NAME: tbl:KeystoneBasic.create_and_list_tenants
|Create And List...|keystone_v3.create_project|keystone_v3.list_projects|std|
|--
|('cockroachdb', 3)|0.122|0.023|0.002|
|('cockroachdb', 9)|0.134|0.025|0.005|
|('cockroachdb', 45)|0.141|0.026|0.004|
|('galera', 3)|0.104|0.020|0.004|
|('galera', 9)|0.105|0.020|0.003|
|('galera', 45)|0.129|0.024|0.014|
|('mariadb', 3)|0.100|0.020|0.004|
|('mariadb', 9)|0.103|0.020|0.003|
|('mariadb', 45)|0.110|0.022|0.004|

#+CAPTION: KeystoneBasic.create_and_list_users
#+NAME: tbl:KeystoneBasic.create_and_list_users
|Create And List...|keystone_v3.create_user|keystone_v3.list_users|std|
|--
|('cockroachdb', 3)|0.139|0.084|0.015|
|('cockroachdb', 9)|0.147|0.085|0.019|
|('cockroachdb', 45)|0.150|0.084|0.009|
|('galera', 3)|0.111|0.058|0.012|
|('galera', 9)|0.114|0.059|0.012|
|('mariadb', 3)|0.108|0.057|0.014|
|('mariadb', 9)|0.111|0.056|0.012|
|('mariadb', 45)|0.120|0.057|0.011|

#+CAPTION: KeystoneBasic.create_user_set_enabled_and_delete
#+NAME: tbl:KeystoneBasic.create_user_set_enabled_and_delete
|Create User Set...|keystone_v3.create_user|keystone_v3.update_user|keystone_v3.delete_user|std|
|--
|('cockroachdb', 3)|0.139|0.081|0.770|3.037|
|('cockroachdb', 9)|0.156|0.105|0.796|1.976|
|('cockroachdb', 45)|0.161|0.111|0.562|1.046|
|('galera', 3)|0.118|0.063|0.108|0.025|
|('galera', 9)|0.117|0.064|0.111|0.015|
|('mariadb', 3)|0.114|0.062|0.108|0.022|
|('mariadb', 9)|0.114|0.058|0.104|0.015|
|('mariadb', 45)|0.137|0.068|0.112|0.032|

#+CAPTION: KeystoneBasic.create_user_update_password
#+NAME: tbl:KeystoneBasic.create_user_update_password
|Create User...|keystone_v3.create_user|keystone_v3.update_user|std|
|--
|('cockroachdb', 3)|0.132|1.253|6.381|
|('cockroachdb', 9)|0.184|0.554|2.726|
|('cockroachdb', 45)|0.181|0.567|2.317|
|('galera', 3)|0.112|0.065|0.006|
|('galera', 9)|0.115|0.069|0.006|
|('mariadb', 3)|0.108|0.063|0.006|
|('mariadb', 9)|0.111|0.065|0.008|
|('mariadb', 45)|0.123|0.069|0.009|

#+CAPTION: KeystoneBasic.get_entities
#+NAME: tbl:KeystoneBasic.get_entities
|Get Entities|keystone_v3.create_project|keystone_v3.create_user|keystone_v3.create_role|keystone_v3.get_project|keystone_v3.get_user|keystone_v3.get_role|keystone_v3.list_services|keystone_v3.get_services|std|
|--
|('cockroachdb', 3)|0.137|0.176|0.031|0.021|0.020|0.020|0.023|0.020|0.011|
|('cockroachdb', 9)|0.146|0.183|0.031|0.021|0.020|0.021|0.024|0.020|0.009|
|('cockroachdb', 45)|0.154|0.197|0.034|0.023|0.023|0.023|0.026|0.022|0.011|
|('galera', 3)|0.114|0.142|0.025|0.018|0.018|0.017|0.019|0.017|0.009|
|('galera', 9)|0.117|0.145|0.025|0.018|0.018|0.018|0.020|0.018|0.009|
|('galera', 45)|0.277|0.357|0.363|0.037|0.030|0.028|0.027|0.020|1.236|
|('mariadb', 3)|0.110|0.137|0.023|0.018|0.018|0.018|0.019|0.017|0.011|
|('mariadb', 9)|0.112|0.141|0.023|0.018|0.018|0.018|0.019|0.017|0.010|
|('mariadb', 45)|0.121|0.150|0.026|0.020|0.020|0.020|0.021|0.020|0.011|

